#include "..\head\LinkStack.h" 
#include <stdio.h>
#include <stdlib.h>
//链栈
StackNode *bottom = NULL;//初始化栈底 
int flag = 0; 
//初始化栈
Status initLStack(LinkStack *s){
	if(flag!=0){
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                  初始化只能进行一次！                *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");//不是空 
		return ERROR;
	}
	s->top = (StackNode*)malloc(sizeof(StackNode));
	s->count = 0;
	s->top->data = 987654321;
	s->top->next = NULL;
	bottom = s->top;
	printf("                                  ____________________________________________________________\n");
	printf("                                  __*            ******************************            *__\n");
	printf("                                  __*                      初始化成功了！                  *__\n"); 
	printf("                                  __*            ******************************            *__\n");
	printf("                                  ____________________________________________________________\n");//输出初始化成功
	flag=1;
	return SUCCESS; 	
}

//判断栈是否为空
Status isEmptyLStack(LinkStack *s){
	if(flag==0){
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                  是不是忘记初始化了！                *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");
		return ERROR;
	}
	if(s->count!=0){
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                     栈并不为空哦！                   *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");	//不是空 
	}else if(s->count==0){
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                       栈是空的！                     *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");//是空 
	}else{
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                      出现错误了！                    *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");//出现错误 
		return ERROR;
	}
}

//得到栈顶元素
Status getTopLStack(LinkStack *s,ElemType *e){
	if(flag==0){
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                  是不是忘记初始化了！                *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");
		return ERROR;
	}
	if(s->top == NULL)
	{
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                  是不是忘记初始化了！                *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");//输出尚未初始化
		return ERROR; 
	}
	*e = s->top->data;
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                       数据为：%d！                  *__\n",*e); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");//输出*e的数值
	return SUCCESS; 
}

//清空栈
Status clearLStack(LinkStack *s){
	if(flag==0){
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                  是不是忘记初始化了！                *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");
		return ERROR;
	}
	StackNode* p=NULL;
	s->count=0;
	s->top=bottom;
	p = bottom;
	while(p){
		p=bottom->next;
		free(bottom);
		bottom=p;
	}
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                        清空栈啦！                    *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");//输出清空完成;
	return SUCCESS; 
}

//销毁栈
Status destroyLStack(LinkStack *s){
	if(flag==0){
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                  是不是忘记初始化了！                *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");
		return ERROR;
	}
	StackNode* p=NULL;
	s->count=0;
	s->top=NULL;
	p=bottom;
	while(p){
		free(bottom);
		p=p->next;
		bottom=p;
	}
	
	flag=0;
	return SUCCESS;
}

//检测栈长度
Status LStackLength(LinkStack *s,int *length){
	if(flag==0){
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                  是不是忘记初始化了！                *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");
		return ERROR;
	}
	if(s->top==NULL)
	{
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*               出错了诶，当前栈是空的！               *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");//无栈
		return ERROR; 
	}
	*length = s->count;
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                         长度为：%d！                 *__\n",*length); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");//输出length;
	return SUCCESS; 
}

//入栈
Status pushLStack(LinkStack *s,ElemType data){
	if(flag==0){
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                  是不是忘记初始化了！                *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");
		return ERROR;
	}
	StackNode* p=(StackNode*)malloc(sizeof(StackNode));
	p->data=data;//输入数据 
	p->next=NULL;//p的下一个为空 
	s->top->next=p;//使得top的下一个指向p 
	s->top = p;//令p成为顶 
	s->count++;
	//成功;
	return SUCCESS; 
}

//出栈
Status popLStack(LinkStack *s,ElemType *data){
	if(flag==0){
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                  是不是忘记初始化了！                *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");
		return ERROR;
	}
	StackNode* p = bottom;
	if(s->count==0){
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*               出错了诶，当前栈是空的！               *__\n"); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");//输出栈为空 
		return ERROR;
	}
	else{
		*data = s->top->data;
		for(;p;p=p->next){
			if(p->next==s->top){
				free(p->next);
				p->next=NULL;
				s->top=p;
				s->count--;
				break;
			}
		}
		printf("                                  ____________________________________________________________\n");
		printf("                                  __*            ******************************            *__\n");
		printf("                                  __*                     数据为：%d！                    *__\n",*data); 
		printf("                                  __*            ******************************            *__\n");
		printf("                                  ____________________________________________________________\n");//输出data
		return SUCCESS; 
	}
}

int InputCheck(){
	int num=0,status=0;
	char str[100];
	int i;
	do{
		
		scanf(" %s",str);
		status=SUCCESS;
		for(i=0;str[i]!='\0';i++)
		{
			if(i==0)
			{
				if (str[i] == '-' || str[i] == '+')
					continue;
			}
			else
			{
				if (str[i] < '0' || str[i] > '9')
				{
					status = ERROR;
					break;
				}
			}
		}
		if(status==ERROR){
			printf("                                  ____________________________________________________________\n");
			printf("                                  __*            ******************************            *__\n");
			printf("                                  __*                 非法输入，请再次尝试！               *__\n"); 
			printf("                                  __*            ******************************            *__\n");
			printf("                                  ____________________________________________________________\n");//非法输入 
		}
		else
		{
			for(i=0,num=0;str[i]!='\0';i++)
			{
				if(i==0)
				{
					if (str[i] == '-' || str[i] == '+')
						continue;//第一位是符号位 跳过 
					else
					{
					num = atoi(str);
					}//不是符号位 增加到num中 
				}			
				else
				{
					num = atoi(str);
				}
			}
			if (str[0] == '-')
            {
				num = -num;
			}
			if (i >= 10)
			{
				printf("                                  ____________________________________________________________\n");
				printf("                                  __*            ******************************            *__\n");
				printf("                                  __*                数据太多了，请重新输入！              *__\n"); 
				printf("                                  __*            ******************************            *__\n");
				printf("                                  ____________________________________________________________\n");//太多了 
				status = ERROR;
			}
		}
	}while (status == ERROR);
	return num;
}

